
Функция РаспределениеТоваровПоСкладам(Параметры) Экспорт 
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТЧ", Параметры.Товары);
	Запрос.УстановитьПараметр("Период", Параметры.Период);
	Запрос.УстановитьПараметр("Регистратор", Параметры.Регистратор);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Параметры.Регистратор.МоментВремени(), ВидГраницы.Исключая));
	Запрос.Текст = "Выбрать * Поместить Распределить Из &ТЧ КАК ТЧ;";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Остатки.Склад КАК Склад,
	               |	Остатки.Номенклатура КАК Номенклатура,
	               |	Остатки.КоличествоОстаток КАК КоличествоОстаток Поместить ОстаткиСмежныхСкладов
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&Граница,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ
	               |						Отбор.Номенклатура
	               |					ИЗ
	               |						Распределелить КАК Отбор
	               |					СГРУППИРОВАТЬ ПО
	               |						Отбор.Номенклатура)
	               |				И НЕ Склад = &Склад) КАК Остатки";
	
	
	
	Возврат новый ТаблицаЗначений;
	
КонецФункции