#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт 
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", новый Структура());
	
	ПодготовитьТаблицыДляДвижений_ТоварыНаСкладах(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);

КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений_ТоварыНаСкладах(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТоварыНаСкладах", Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Ссылка КАК Регистратор,
	               |	&ВидДвиженияПриход КАК ВидДвижения,
	               |	ТЧ.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ТЧ.Номенклатура КАК Номенклатура,
				   |	&Склад КАК Склад,
	               |	ТЧ.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПриходнаяНакладная.Товары КАК ТЧ
	               |ГДЕ
	               |	ТЧ.Ссылка = &ДокументСсылка  
				   |	";
	//           
	Запрос.УстановитьПараметр("Период", Ссылка.Дата); 
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);  
	Запрос.УстановитьПараметр("Склад", Ссылка.Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТоварыНаСкладах", Выборка);

КонецПроцедуры

Процедура СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТоварыНаСкладах;
	Если ТаблицаДвижений.Количество() > 0 Тогда
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Движения.ТоварыНаСкладах.Загрузить(ТаблицаДвижений);
	КонецЕсли;
	
КонецПроцедуры

#Область Проверки

#КонецОбласти

#КонецОбласти

#КонецЕсли
